app/views/shared/home/_produtos_cards.html.erb

          <div class="d-flex justify-content-between align-items-center mb-2">
            <% if produto.g_categoria.present? %>
---
SELECT "g_categorias".* FROM "g_categorias"