app/views/i_promocao_produtos/_form.html.erb

SELECT "i_produtos".* FROM "i_produtos"
---
      <h5 class="my-0">
        <%= @i_promocao_produto.new_record? ? "Incluir " : "Editar " %><%= t("activerecord.models.#{IPromocaoProduto.model_name.i18n_key}.one") %>

SELECT "i_produtos".* FROM "i_produtos"
---
        <div class="col-12">
          <%= f.association :i_produto,  collection: IProduto.all,  value_method: :id,  label_method: :nome,  input_html: { class: "capitalize" },  placeholder: "I produto" %>