app/views/devise/registrations/new.html.erb

      <%= f.label :g_tipo_usuario_id, "Tipo de Usuário", class: 'form-label' %>
      <%= f.select :g_tipo_usuario_id, GTipoUsuario.all.collect { |t| [t.nome, t.id] }, include_blank: "Selecione um tipo", class: 'form-control' %>
---
SELECT "g_tipo_usuarios".* FROM "g_tipo_usuarios"