app/views/g_categorias/_form.html.erb

        <div class="col-12">
          <%= f.association :segmento,  collection: Segmento.all,  label_method: :nome,  value_method: :id,  input_html: { class: "capitalize" },  placeholder: "Segmento" %>
---
SELECT "segmentos".* FROM "segmentos"