app/views/home/papelaria.html.erb

SELECT "g_categorias".* FROM "g_categorias" ORDER BY "g_categorias"."nome" ASC
---
        <%= button_tag 'Todos', class: 'filter-btn active', data: { categoria: 'todos' } %>
        <% GCategoria.order(:nome).each do |g_categoria| %>