app/views/i_produtos/_form.html.erb

SELECT "g_categorias".* FROM "g_categorias"
---
        <div class="col-5">
          <%= f.input :g_categoria_id, collection: GCategoria.all.map { |c| [c.nome, c.id] }, prompt: "Selecione a categoria", input_html: { class: "capitalize" } %>