app/controllers/store/carrinho_controller.rb

  def adicionar
    produto = IProduto.find_by(id: params[:produto_id])
---
SELECT "i_produtos".* FROM "i_produtos" WHERE "i_produtos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def remover
    produto = IProduto.find_by(id: params[:produto_id])
    unless produto
      flash[:alert] = "Produto não encontrado."
      return redirect_to store_carrinho_path
    end

    item = @carrinho.i_itens_carrinhos.find_by(i_produto: produto)

    if item
      item.destroy
---
DELETE FROM "i_itens_carrinhos" WHERE "i_itens_carrinhos"."id" = $1  [["id", 1]]

  def limpar
    if @carrinho.i_itens_carrinhos.empty?
      flash[:alert] = "O carrinho já está vazio."
    else
      @carrinho.i_itens_carrinhos.destroy_all
---
DELETE FROM "i_itens_carrinhos" WHERE "i_itens_carrinhos"."id" = $1  [["id", 1]]