app/controllers/g_categorias_controller.rb

  def create
    @g_categoria = GCategoria.new(g_categoria_params)

    if @g_categoria.save
---
INSERT INTO "g_categorias" ("nome", "slug", "descricao", "segmento_id", "deleted_at", "created_by", "updated_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @g_categoria.update(g_categoria_params)
---
UPDATE "g_categorias" SET "updated_at" = $1 WHERE "g_categorias"."id" = $2  [["updated_at", "2025-04-13 18:09:54.365173"], ["id", 2]]

  def destroy
    if @g_categoria.destroy
---
DELETE FROM "g_categorias" WHERE "g_categorias"."id" = $1  [["id", 1]]

  def set_g_categoria
    @g_categoria = GCategoria.find_by(id: params[:id])
---
SELECT "g_categorias".* FROM "g_categorias" WHERE "g_categorias"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]