app/controllers/g_tipo_usuarios_controller.rb

  def create
    @g_tipo_usuario = GTipoUsuario.new(g_tipo_usuario_params)

    if @g_tipo_usuario.save
      redirect_to g_tipo_usuarios_path, notice: t('messages.created_successfully')
---
INSERT INTO "g_tipo_usuarios" ("nome", "descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "g_tipo_usuarios" ("nome", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "g"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-03-20 16:08:27.938815"], ["updated_at", "2025-03-20 16:08:27.938815"]]

  def update
    if @g_tipo_usuario.update(g_tipo_usuario_params)
---
UPDATE "g_tipo_usuarios" SET "descricao" = $1, "updated_at" = $2 WHERE "g_tipo_usuarios"."id" = $3  [["descricao", "Administrador do sistema."], ["updated_at", "2025-03-31 22:41:05.181035"], ["id", 1]]

  def destroy
    if @g_tipo_usuario.destroy
      redirect_to g_tipo_usuarios_url, notice: t('messages.deleted_successfully')
---
DELETE FROM "g_tipo_usuarios" WHERE "g_tipo_usuarios"."id" = $1  [["id", 3]]
DELETE FROM "g_tipo_usuarios" WHERE "g_tipo_usuarios"."id" = $1  [["id", 2]]

  def set_g_tipo_usuario
    @g_tipo_usuario = GTipoUsuario.find_by(id: params[:id])
---
SELECT "g_tipo_usuarios".* FROM "g_tipo_usuarios" WHERE "g_tipo_usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]