app/controllers/home_controller.rb

SELECT "g_categorias".* FROM "g_categorias"
SELECT "g_categorias".* FROM "g_categorias" WHERE "g_categorias"."slug" = $1 LIMIT $2  [["slug", "produtos"], ["LIMIT", 1]]
---
  def index
    @g_categorias = GCategoria.all
    if params[:categoria].present?
      categoria = GCategoria.find_by(slug: params[:categoria])
      if categoria.present?

SELECT "g_categorias".* FROM "g_categorias" ORDER BY "g_categorias"."nome" ASC
SELECT "i_produtos".* FROM "i_produtos" WHERE "i_produtos"."status" = $1 ORDER BY "i_produtos"."created_at" DESC  [["status", 1]]
---
  def papelaria
    @g_categorias = GCategoria.order(:nome)

    if params[:categoria].present?
      categoria = GCategoria.find_by(slug: params[:categoria])
      if categoria.present?
        @pagy, @produtos = pagy(
          categoria.i_produtos.where(status: :ativo).order(created_at: :desc),
          items: 6
        )