app/controllers/i_produtos_controller.rb

  def set_i_produto
    @i_produto = IProduto.find_by(slug: params[:id])
---
SELECT "i_produtos".* FROM "i_produtos" WHERE "i_produtos"."slug" = $1 LIMIT $2  [["slug", "HP"], ["LIMIT", 1]]