app/controllers/i_promocao_produtos_controller.rb

  def create
    @i_promocao_produto = IPromocaoProduto.new(i_promocao_produto_params)

    if @i_promocao_produto.save
---
INSERT INTO "i_promocao_produtos" ("i_promocao_id", "i_produto_id", "preco_promocional", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_i_promocao_produto
    @i_promocao_produto = IPromocaoProduto.find_by(id: params[:id])
---
SELECT "i_produtos".* FROM "i_produtos" WHERE "i_produtos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]