app/controllers/i_produtos_controller.rb

INSERT INTO "i_produtos" ("nome", "slug", "descricao", "preco", "g_categoria_id", "arquivo_url", "imagem_url", "status", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @i_produto = IProduto.new(i_produto_params)

    if @i_produto.save

UPDATE "i_produtos" SET "updated_at" = $1 WHERE "i_produtos"."id" = $2  [["updated_at", "2025-04-14 06:06:43.353595"], ["id", 3]]
---
  def update
    if @i_produto.update(i_produto_params)

DELETE FROM "i_produtos" WHERE "i_produtos"."id" = $1  [["id", 2]]
---
def destroy
  if @i_produto.status != "inativo"
    redirect_to i_produtos_url, notice: "Só é possível excluir produtos com status 'inativo', altere o status do produto."
  else
    @i_produto.i_itens_carrinhos.destroy_all

SELECT "i_produtos".* FROM "i_produtos" WHERE "i_produtos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_i_produto
    @i_produto = IProduto.friendly.find(params[:id])