app/controllers/i_promocoes_controller.rb

INSERT INTO "i_promocoes" ("nome", "descricao", "ativo", "slug", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @i_promocao = IPromocao.new(i_promocao_params)

    if @i_promocao.save
      redirect_to i_promocoes_path, notice: t('messages.created_successfully')