app/controllers/segmentos_controller.rb

  def create
    @segmento = Segmento.new(segmento_params)

    if @segmento.save
---
INSERT INTO "segmentos" ("nome", "descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    if @segmento.destroy
---
DELETE FROM "segmentos" WHERE "segmentos"."id" = $1  [["id", 2]]

  def set_segmento
    @segmento = Segmento.find_by(id: params[:id])
---
SELECT "segmentos".* FROM "segmentos" WHERE "segmentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]