app/controllers/store_controller.rb

SELECT "g_categorias".* FROM "g_categorias" ORDER BY "g_categorias"."nome" ASC
---
  def papelaria
    @g_categorias = GCategoria.order(:nome)